.appsec-tests/vpatch-CVE-2024-28752/CVE-2024-28752.yaml

## autogenerated on 2026-07-01 13:06:32
id: CVE-2024-28752
info:
  name: CVE-2024-28752
  author: crowdsec
  severity: info
  description: CVE-2024-28752 testing
  tags: appsec-testing
http:
  - raw:
      - |
        POST /test HTTP/1.1
        Host: {{Hostname}}
        Content-Type: multipart/related; boundary=----nucleibound

        ------nucleibound
        Content-Disposition: form-data; name="1"

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://service.namespace/">
           <soapenv:Header/>
           <soapenv:Body>
              <web:test>
                 <arg0>
        <count><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///etc/passwd"></xop:Include></count>
        </arg0>
              </web:test>
           </soapenv:Body>
        </soapenv:Envelope>
        ------nucleibound--
    cookie-reuse: true
    matchers:
    - type: status
      status:
       - 403
